In [1]:
from config import user_name
from config import password
from sqlalchemy import create_engine
import pandas as pd
import matplotlib as plt

In [6]:
engine = create_engine(f'postgresql://{user_name}:{password}@localhost:5432/sql_challenge')

In [7]:
connection = engine.connect()

In [11]:
salaries = pd.read_sql("SELECT * FROM salaries",connection)

In [10]:
salaries

        emp_no  salary
0        10001   60117
1        10002   65828
2        10003   40006
3        10004   40054
4        10005   78228
...        ...     ...
300019  499995   40000
300020  499996   58058
300021  499997   49597
300022  499998   40000
300023  499999   63707

[300024 rows x 2 columns]